# ExternalServiceId Operators

---
The ExternalServiceId type exposes the following members.
| Name| Description
---|---|---
| Equality(ExternalServiceId, ExternalServiceId)| Compares two ExternalServiceId instances.
| Inequality(ExternalServiceId, ExternalServiceId)| Compares two ExternalServiceId instances.
Top
#### Reference
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace